In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "name" : ["billy","Noah","mike","steve","michael"],
    "salary" : [450000,400000,350000,320000,250000],
    "joining_date" : ['2000-04-12','2003-04-27','2008-04-18','2009-04-18','2015-04-19'],
    "exit_date" : ['2022-03-18','2021-05-28','2019-07-28','2025-09-21','2024-10-29']
})

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          5 non-null      object
 1   salary        5 non-null      int64
 2   joining_date  5 non-null      object
 3   exit_date     5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [4]:
df

      name  salary joining_date   exit_date
0    billy  450000   2000-04-12  2022-03-18
1     Noah  400000   2003-04-27  2021-05-28
2     mike  350000   2008-04-18  2019-07-28
3    steve  320000   2009-04-18  2025-09-21
4  michael  250000   2015-04-19  2024-10-29

In [5]:
df['joining_date'] = pd.to_datetime(df['joining_date'])
df['exit_date'] = pd.to_datetime(df['exit_date'])

In [6]:
df

      name  salary joining_date  exit_date
0    billy  450000   2000-04-12 2022-03-18
1     Noah  400000   2003-04-27 2021-05-28
2     mike  350000   2008-04-18 2019-07-28
3    steve  320000   2009-04-18 2025-09-21
4  michael  250000   2015-04-19 2024-10-29

In [7]:
df['joining_year'] = df['joining_date'].dt.year
df['joining_month'] = df['joining_date'].dt.month
df['joining_day'] = df['joining_date'].dt.day

In [8]:
df['days_since_join'] = (pd.Timestamp.today() - df['joining_date']).dt.days

In [9]:
df['month_name'] = df['joining_date'].dt.month_name()

In [10]:
df

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name
0,billy,450000,2000-04-12,2022-03-18,2000,4,12,9381,April
1,Noah,400000,2003-04-27,2021-05-28,2003,4,27,8271,April
2,mike,350000,2008-04-18,2019-07-28,2008,4,18,6453,April
3,steve,320000,2009-04-18,2025-09-21,2009,4,18,6088,April
4,michael,250000,2015-04-19,2024-10-29,2015,4,19,3896,April

In [11]:
df = df.sort_values(by='joining_date', ascending=False)

In [12]:
df.reset_index(drop=True)

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name
0,michael,250000,2015-04-19,2024-10-29,2015,4,19,3896,April
1,steve,320000,2009-04-18,2025-09-21,2009,4,18,6088,April
2,mike,350000,2008-04-18,2019-07-28,2008,4,18,6453,April
3,Noah,400000,2003-04-27,2021-05-28,2003,4,27,8271,April
4,billy,450000,2000-04-12,2022-03-18,2000,4,12,9381,April

In [13]:
filtered = df[df['joining_date'] == '2000-04-12']

In [14]:
joining_date = '2000-04-12'
end_date = '2025-09-28'
filtered_range = df[(df['joining_date'] >= joining_date) & (df['joining_date'] < end_date)]

In [15]:
filtered_range

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name
4,michael,250000,2015-04-19,2024-10-29,2015,4,19,3896,April
3,steve,320000,2009-04-18,2025-09-21,2009,4,18,6088,April
2,mike,350000,2008-04-18,2019-07-28,2008,4,18,6453,April
1,Noah,400000,2003-04-27,2021-05-28,2003,4,27,8271,April
0,billy,450000,2000-04-12,2022-03-18,2000,4,12,9381,April

In [16]:
start = '2005-01-01'
end   = '2010-01-01'

filtered_range = df[(df['joining_date'] >= start) & (df['joining_date'] < end)]
print(filtered_range)

    name  salary joining_date  exit_date  joining_year  joining_month  \
3  steve  320000   2009-04-18 2025-09-21          2009              4
2   mike  350000   2008-04-18 2019-07-28          2008              4

   joining_day  days_since_join month_name
3           18             6088      April
2           18             6453      April

In [17]:
# every syntax should be separate 
df[df['joining_date'].dt.year == 2000] #by year
df[df['joining_date'].dt.month == 4] # By month
df[df['joining_date'].dt.day == 19] # by date

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name
4,michael,250000,2015-04-19,2024-10-29,2015,4,19,3896,April

In [18]:
df.query("joining_date >= '2000-01-01' and joining_date <= '2009-12-31'")

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name
3,steve,320000,2009-04-18,2025-09-21,2009,4,18,6088,April
2,mike,350000,2008-04-18,2019-07-28,2008,4,18,6453,April
1,Noah,400000,2003-04-27,2021-05-28,2003,4,27,8271,April
0,billy,450000,2000-04-12,2022-03-18,2000,4,12,9381,April

 ### For MONTHS AND YEAR WE USE DATE OFFSET 
 #### BUT WHEN WE NEED PARTICULAR DAY/TIME/ HOUR WE USE TIMEDELTA

In [19]:
# Add 5 years (future date)
df['future_date'] = df['joining_date'] + pd.DateOffset(years=5)

# Subtract 2 years (past date)
df['past_date'] = df['joining_date'] - pd.DateOffset(years=2)

In [20]:
df

,name,salary,joining_date,exit_date,joining_year,joining_month,joining_day,days_since_join,month_name,future_date,past_date
4,michael,250000,2015-04-19,2024-10-29,2015,4,19,3896,April,2020-04-19,2013-04-19
3,steve,320000,2009-04-18,2025-09-21,2009,4,18,6088,April,2014-04-18,2007-04-18
2,mike,350000,2008-04-18,2019-07-28,2008,4,18,6453,April,2013-04-18,2006-04-18
1,Noah,400000,2003-04-27,2021-05-28,2003,4,27,8271,April,2008-04-27,2001-04-27
0,billy,450000,2000-04-12,2022-03-18,2000,4,12,9381,April,2005-04-12,1998-04-12

In [21]:
from datetime import timedelta

df['future_30days'] = df['joining_date'] +  timedelta(days = 30)
df['past_30days'] = df['joining_date'] - timedelta(days = 30)

In [22]:
df['total_days'] = (df['exit_date'] - df['joining_date']).dt.days

In [23]:
df['total_year'] = df['total_days']/365

In [32]:
df['total_seconds'] = (df['exit_date'] - df['joining_date']).dt.total_seconds()

In [25]:
df1 = pd.DataFrame ({
                    "sales" : [90,120,150,186,156,200]
})

In [42]:
df1['prev_sales'] = df1['sales'].shift(1)

In [43]:
df1

   sales  prev_sales  change_in_sales  sales_pct
0     90       120.0              NaN        NaN
1    120       150.0             30.0   0.333333
2    150       186.0             30.0   0.250000
3    186       156.0             36.0   0.240000
4    156       200.0            -30.0  -0.161290
5    200         NaN             44.0   0.282051

In [40]:
df1['change_in_sales'] = df1['sales']- df1['sales'].shift(1)

In [41]:
df1

   sales  prev_sales  change_in_sales  sales_pct
0     90         NaN              NaN        NaN
1    120        90.0             30.0   0.333333
2    150       120.0             30.0   0.250000
3    186       150.0             36.0   0.240000
4    156       186.0            -30.0  -0.161290
5    200       156.0             44.0   0.282051

In [30]:
df1['sales_pct'] = (df1['sales']-df1['sales'].shift(1) ) / df1['sales'].shift(1)

In [31]:
df1

   sales  prev_sales  change_in_sales  sales_pct
0     90         NaN              NaN        NaN
1    120        90.0             30.0   0.333333
2    150       120.0             30.0   0.250000
3    186       150.0             36.0   0.240000
4    156       186.0            -30.0  -0.161290
5    200       156.0             44.0   0.282051